import React from 'react'

type Props = {}

const Methodology = (props: Props) => {
  return (
    <div className='wv-ibmplex wv-b5 wv-regular px-[20px] max-h-[70vh] overflow-y-scroll'>
      กระบวนการเก็บข้อมูลชุดนี้ มีดังต่อไปนี้
      <ol className='list-decimal wv-b7'>
        <li>
          <span className='wv-bold'>การเก็บข้อมูลพาดหัวข่าว</span>
          <ol className='list-disc list-inside'>
            <li>เลือกพาดหัวข่าวจากข่าวของ “สำนักข่าวผู้จัดการออนไลน์” เนื่องจากเป็นสำนักข่าวที่มีข่าวย้อนหลังครอบคลุมช่วงเวลาที่ต้องการมากที่สุด</li>
            <li>ใช้กระบวนการ Data Scraping เพื่อรวบรวมพาดหัวข่าวของข่าวหมวดการเมืองในช่วงเวลาที่ต้องการ ได้แก่ระหว่างวันที่ 4 กรกฎาคม 2556 - 01 กันยายน 2565</li>
          </ol>
        </li>
        <li>
          <span className='wv-bold'>Matching ตัวละครการเมือง กับข้อมูลพาดหัวข่าว</span>
          <ol className='list-disc list-inside'>
            <li>กำหนด Keywords ของตัวละครการเมืองที่จะใช้ในการ Matching โดยหากเป็นชื่อองค์กร จะมีชื่อเต็ม ชื่อย่อ หรือชื่ออื่น ๆ ที่เกี่ยวข้อง (ถ้ามี) เป็น Keywords หากเป็นชื่อบุคคล จะมีชื่อจริง (ไม่มีนามสกุล และคำนำหน้า) ชื่อเล่น (ถ้ามี) หรือฉายาทางการเมืองอื่น ๆ (ถ้ามี) เป็น Keywords</li>
            <li>ใช้กระบวนการ Coding เพื่อ Matching Keywords ของตัวละครการเมืองกับข้อมูลพาดหัวข่าวทั้งหมด ให้ได้มาซึ่งข้อมูลพาดหัวข่าวที่มีชื่อของตัวละครการเมืองที่ต้องการ</li>
          </ol>
        </li>
        <li>
          <span className='wv-bold'>จัดการข้อมูลพาดหัวข่าวที่มีตัวละครการเมือง</span>
          <ol className='list-disc list-inside'>
            <li>เมื่อได้ข้อมูลพาดหัวข่าวซึ่งมีตัวละครการเมืองที่ต้องการ นำมาทำการ Cleaning เพื่อให้ได้ข้อมูลที่ต้องการ และตัดข้อมูลที่มีไม่ต้องการออกไป ได้แก่ พาดหัวข่าวที่ไม่ตรงกับชื่อของตัวละครการเมืองที่ถูก Matching และพาดหัวข่าวที่มีการพูดถึงตัวละครการเมืองนั้นไม่เกิน 1 ครั้ง</li>
            <li>หลังจากนั้น ทำการให้คะแนน (Scoring) ข้อมูลพาดหัวข่าวที่เหลืออยู่ ว่ามีความเป็น +/- ต่อรัฐบาลในช่วงเวลานั้นอย่างไรบ้าง ถ้าเป็น + ก็จะได้ +1 คะแนน ถ้าเป็นลบก็จะได้ -1 คะแนน หากวัดค่าไม่ได้จะได้ 0 คะแนน</li>
            <li>นำข้อมูลพาดหัวข่าวที่ผ่านการ Cleaning และ Scoring เรียบร้อยแล้ว มาทำการ Analyzing เพื่อหา Insides ต่าง ๆ ต่อไป</li>
          </ol>
        </li>
      </ol>
      <br />
      <span><span className='wv-bold'>Disclaimer:</span> โปรดใช้วิจารณญาณในการรับชมงานนี้ เนื่องจาก</span>
      <ol className='list-decimal wv-b7'>
        <li>การเลือกพาดหัวข่าวจากสำนักข่าวผู้จัดการออนไลน์เพียงแห่งเดียว อาจไม่สามารถวัด Insides ทางการเมืองได้ 100 %</li>
        <li>Keywords ของตัวละครการเมือง อาจไม่สามารถครอบคลุมทุกชื่อที่เกี่ยวข้องกับตัวละครนั้นได้ 100 %</li>
        <li>พาดหัวข่าวที่ถูกให้คะแนน (Scoring) ความเป็น +/- ต่อรัฐบาลในช่วงเวลานั้น มีได้ทั้งการกระทำของตัวละครที่ส่งผลต่อรัฐบาลช่วงเวลานั้น และ/หรือ การที่ชื่อตัวละครถูกพาดพิงในการกระทำที่ส่งผลต่อรัฐบาลช่วงเวลานั้น</li>
      </ol>
      <br />
    </div>
  )
}

export default Methodology